report/sysbench/SSP_test/oltp_write_only.master_ssm_200.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 14459.92 qps: 86934.59 (r/w/o: 0.00/57974.98/28959.61) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 14402.84 qps: 86404.43 (r/w/o: 0.00/57599.35/28805.08) lat (ms,99%): 31.94 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 14344.73 qps: 86088.40 (r/w/o: 0.00/57398.14/28690.27) lat (ms,99%): 32.53 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 14485.12 qps: 86901.94 (r/w/o: 0.00/57931.89/28970.05) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 13948.61 qps: 83675.87 (r/w/o: 0.00/55778.84/27897.02) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 14553.40 qps: 87337.81 (r/w/o: 0.00/58231.61/29106.20) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 14611.12 qps: 87644.73 (r/w/o: 0.00/58422.49/29222.24) lat (ms,99%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 14502.16 qps: 87042.15 (r/w/o: 0.00/58037.23/29004.92) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 14461.10 qps: 86759.60 (r/w/o: 0.00/57837.60/28922.00) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 14633.12 qps: 87799.90 (r/w/o: 0.00/58534.47/29265.43) lat (ms,99%): 29.72 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 14388.62 qps: 86330.70 (r/w/o: 0.00/57552.27/28778.43) lat (ms,99%): 33.12 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 14717.14 qps: 88282.87 (r/w/o: 0.00/58849.18/29433.69) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 14703.61 qps: 88243.87 (r/w/o: 0.00/58836.25/29407.62) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 14757.22 qps: 88511.10 (r/w/o: 0.00/58997.06/29514.03) lat (ms,99%): 28.16 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 14379.65 qps: 86321.33 (r/w/o: 0.00/57561.42/28759.91) lat (ms,99%): 31.37 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 14626.82 qps: 87724.10 (r/w/o: 0.00/58473.47/29250.63) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 14169.43 qps: 85039.16 (r/w/o: 0.00/56697.91/28341.25) lat (ms,99%): 34.33 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 14586.86 qps: 87523.15 (r/w/o: 0.00/58348.84/29174.32) lat (ms,99%): 29.19 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 14262.32 qps: 85574.34 (r/w/o: 0.00/57049.89/28524.45) lat (ms,99%): 34.95 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 14312.99 qps: 85870.16 (r/w/o: 0.00/57244.37/28625.79) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 14174.84 qps: 85060.43 (r/w/o: 0.00/56710.36/28350.08) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 14437.35 qps: 86609.72 (r/w/o: 0.00/57735.21/28874.51) lat (ms,99%): 30.26 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 14190.82 qps: 85155.93 (r/w/o: 0.00/56774.29/28381.64) lat (ms,99%): 33.72 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 14441.24 qps: 86644.85 (r/w/o: 0.00/57766.57/28878.28) lat (ms,99%): 30.81 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           6931932
        other:                           3465966
        total:                           10397898
    transactions:                        1732983 (14436.99 per sec.)
    queries:                             10397898 (86621.95 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          120.0363s
    total number of events:              1732983

Latency (ms):
         min:                                    3.75
         avg:                                   13.85
         max:                                  227.04
         99th percentile:                       31.37
         sum:                             24000429.08

Threads fairness:
    events (avg/stddev):           8664.9150/29.80
    execution time (avg/stddev):   120.0021/0.01